api/ws-getOutMailEvents.html

<div class ="sidebar" >    
    <h2>Kazalo:</h2>
    <ul>
        <li><a href="#documentation:webservices">Spletne storitve</a></li> 
    </ul>
</div>
<div class="main">
<article class='content'>

<h1>Metoda: getOutMailEvents</h1>
Poizvedbe: <a href="api/wsdl/messages/OutMailEventListRequest.xsd">OutMailEventListRequest.xsd</a><br />
Odgovor: <a href="api/wsdl/messages/OutMailEventListResponse.xsd">OutMailEventListResponse.xsd</a><br />
Namen metode je pridobivanje seznama dogodkov na izhodni pošiljki. Seznam dogodkov služi kot revizijska sled in se lahko uporablja za sledenje pošiljk. 

<br />
<h2>Parametri poizvedbe</h2>
<div class="jrcxslt" data-xml="api/wsdl/messages/OutMailEventListRequest.xsd" data-xslt="xslt/mshinmail2table.xslt"></div>
<h2>Primer poizvedbe</h2>

 <pre><code>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:laur="http://laurentius.si">
   &lt;soapenv:Header/>
   &lt;soapenv:Body>
      &lt;laur:OutMailEventListRequest>
         &lt;Control userId="TestUser" applicationId="CMS" />
         &lt;Data senderEBox="izvrsba@court-laurentius.si"  
         			mailId="47" />
      &lt;/laur:OutMailEventListRequest>
   &lt;/soapenv:Body>
&lt;/soapenv:Envelope> 
</code></pre>

<h2>Primer odgovora</h2>
 <pre><code>
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   &lt;soap:Body>
      &lt;ns2:OutMailEventListResponse xmlns:ns2="http://laurentius.si" xmlns:ns3="http://outbox.laurentius.si/event" xmlns:ns4="http://inbox.laurentius.si/property" xmlns:ns5="http://inbox.laurentius.si/payload" xmlns:ns6="http://inbox.laurentius.si/mail" xmlns:ns7="http://outbox.laurentius.si/property" xmlns:ns8="http://outbox.laurentius.si/payload" xmlns:ns9="http://outbox.laurentius.si/mail" xmlns:ns10="http://inbox.laurentius.si/event">
         &lt;RControl resultSize="3" startIndex="0" responseSize="3" returnValue="1"/>
         &lt;RData>
            &lt;OutEvent id="51" mailId="47" senderMessageId="cms-id-00001" date="2016-11-27T18:27:04.952+01:00" status="SUBMITTED" description="Message is sucessfuly added to SED for transmition." userId="TestUser" applicationId="CMS"/>
            &lt;OutEvent id="52" mailId="47" senderMessageId="cms-id-00001" date="2016-11-27T18:27:05.146+01:00" status="PUSHING" description="Start pushing to receiver MSH"/>
            &lt;OutEvent id="60" mailId="47" senderMessageId="cms-id-00001" date="2016-11-27T18:27:07.192+01:00" status="SENT" description="Message sent to receiver MSH"/>
         &lt;/RData>
      &lt;/ns2:OutMailEventListResponse>
   &lt;/soap:Body>
&lt;/soap:Envelope>

</code></pre>



</article>  
</div>