api/ws-getInMailEvents.html

<div class ="sidebar" >    
    <h2>Kazalo:</h2>
    <ul>
        <li><a href="#documentation:webservices">Spletne storitve</a></li> 
    </ul>
</div>
<div class="main">
<article class='content'>

<h1>Metoda: getInMailEvents</h1>
Poizvedbe: <a href="api/wsdl/messages/OutMailEventListRequest.xsd">InMailEventListRequest.xsd</a><br />
Odgovora: <a href="api/wsdl/messages/OutMailEventListResponse.xsd">InMailEventListResponse.xsd</a><br />
Namen metode je pridobivanje seznama dogodkov na dohodni pošiljki. 

<br />
<h2>Parametri poizvedbe</h2>
<div class="jrcxslt" data-xml="api/wsdl/messages/InMailEventListRequest.xsd" data-xslt="xslt/mshinmail2table.xslt"></div>
<h2>Primer poizvedbe</h2>

 <pre><code>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:laur="http://laurentius.si">
   &lt;soapenv:Header/>
   &lt;soapenv:Body>
      &lt;laur:InMailEventListRequest>
         &lt;Control userId="TestUser" applicationId="CMS" />         
         &lt;Data receiverEBox="ezk@court-laurentius.si" mailId="53" />
      &lt;/laur:InMailEventListRequest>
   &lt;/soapenv:Body>
&lt;/soapenv:Envelope>
</code></pre>

<h2>Primer odgovora</h2>
 <pre><code>
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   &lt;soap:Body>
      &lt;ns2:InMailEventListResponse xmlns:ns2="http://laurentius.si" xmlns:ns3="http://outbox.laurentius.si/event" xmlns:ns4="http://inbox.laurentius.si/property" xmlns:ns5="http://inbox.laurentius.si/payload" xmlns:ns6="http://inbox.laurentius.si/mail" xmlns:ns7="http://outbox.laurentius.si/property" xmlns:ns8="http://outbox.laurentius.si/payload" xmlns:ns9="http://outbox.laurentius.si/mail" xmlns:ns10="http://inbox.laurentius.si/event">
         &lt;RControl resultSize="4" startIndex="0" responseSize="4" returnValue="1"/>
         &lt;RData>
            &lt;InEvent id="57" mailId="53" date="2016-11-27T20:13:03.237+01:00" status="RECEIVED" description="Mail stored to inbox" applicationId="Laurentius-msh-ws"/>
            &lt;InEvent id="58" mailId="53" date="2016-11-27T20:13:03.298+01:00" status="RECEIVED" description="Message is sucessfuly received to MSH."/>
            &lt;InEvent id="59" mailId="53" date="2016-11-27T20:13:03.398+01:00" status="ERROR" description="Receiver box 'ezk@court-laurentius.si' does not have configurationf for exporting mail! Export suppressed for mail 53!"/>
            &lt;InEvent id="61" mailId="53" date="2016-11-27T20:13:54.066+01:00" status="DELIVERED" description="Message is consumed" userId="TestUser" applicationId="CMS"/>
         &lt;/RData>
      &lt;/ns2:InMailEventListResponse>
   &lt;/soap:Body>
&lt;/soap:Envelope>

</code></pre>



</article>  
</div>